<template>
  <router-view />
</template>

<script setup>
  //

  /**
   * 
   * Далее идет список товаров. Каждая строка содержит в себе информацию о товаре:
      a. Заголовок товара – максимум 255 символов
      b. Описание товара – может быть достаточно длинным
      c.	Картинку товара 
      d. Информация о наличии товара. Вычисляется следующим образом: 
          если кол-во товара на складе 0, то Нет в наличии. 
          Если больше 5 – то В наличии. Если 1,2,3,4 или 5 – то Мало.
      e. Цена товара. В случае, когда пользователь не авторизован (гость), 
          то отображается базовая цена. Если пользователь авторизован, 
          то отображается скидочная цена (если она присутствует у товара), а справа перечеркнута базовая цена:


      item: {
        title: "",
        description: "",
        img: "",
        amount: number,
        price: number, 
          * priceGuest = price,
          * priceUser = price * 0.8 || null
      }
   */
</script>


<style>

#app{
    height: 100%;
    display: flex;
    flex-direction: column;
}


.container {
  height: 100%;
  width: 80%;
  margin: 0 auto;
}

</style>

